---
kind: method
id: M:Autodesk.Revit.DB.Categories.ForwardIterator
source: html/7d7f07c1-c704-9a6a-bb5a-53727cdc883b.htm
---
# Autodesk.Revit.DB.Categories.ForwardIterator Method

Retrieves a forward moving iterator to the map.

## Syntax (C#)
```csharp
public override CategoryNameMapIterator ForwardIterator()
```

## Returns
A forward moving iterator to the map.